hpmicro/rtt-bsp-hpm6750evk2/common/libraries/hpm_sdk/soc/ip/hpm_cam_regs.h
/*
 * C4 (RW)
 *
 * Two's compliment Blue U/Cb multiplier coefficient. YUV=0x208 (2.032) YCbCr=0x204 (2.017).
 */
#define CAM_CSC_COEF1_C4_MASK (0x7FFU)
#define CAM_CSC_COEF1_C4_SHIFT (0U)
#define CAM_CSC_COEF1_C4_SET(x) (((uint32_t)(x) << CAM_CSC_COEF1_C4_SHIFT) & CAM_CSC_COEF1_C4_MASK)
#define CAM_CSC_COEF1_C4_GET(x) (((uint32_t)(x) & CAM_CSC_COEF1_C4_MASK) >> CAM_CSC_COEF1_C4_SHIFT)

/* Bitfield definition for register: CSC_COEF2 */
/*
 * C2 (RW)
 *
 * Two's compliment Green V/Cr multiplier coefficient. YUV=0x76B (-0.581) YCbCr=0x730 (-0.813).
 */
#define CAM_CSC_COEF2_C2_MASK (0x7FF0000UL)
#define CAM_CSC_COEF2_C2_SHIFT (16U)
#define CAM_CSC_COEF2_C2_SET(x) (((uint32_t)(x) << CAM_CSC_COEF2_C2_SHIFT) & CAM_CSC_COEF2_C2_MASK)
#define CAM_CSC_COEF2_C2_GET(x) (((uint32_t)(x) & CAM_CSC_COEF2_C2_MASK) >> CAM_CSC_COEF2_C2_SHIFT)

/*
 * C3 (RW)
 *
 * Two's compliment Green U/Cb multiplier coefficient. YUV=0x79C (-0.394) YCbCr=0x79C (-0.392).
 */
#define CAM_CSC_COEF2_C3_MASK (0x7FFU)
#define CAM_CSC_COEF2_C3_SHIFT (0U)
#define CAM_CSC_COEF2_C3_SET(x) (((uint32_t)(x) << CAM_CSC_COEF2_C3_SHIFT) & CAM_CSC_COEF2_C3_MASK)
#define CAM_CSC_COEF2_C3_GET(x) (((uint32_t)(x) & CAM_CSC_COEF2_C3_MASK) >> CAM_CSC_COEF2_C3_SHIFT)

/* Bitfield definition for register: CLRKEY_LOW */
/*
 * LIMIT (RW)
 *
 * Low range of color key applied to PS buffer. To disable PS colorkeying, set the low colorkey to 0xFFFFFF and the high colorkey to 0x000000.
 */
#define CAM_CLRKEY_LOW_LIMIT_MASK (0xFFFFFFUL)
#define CAM_CLRKEY_LOW_LIMIT_SHIFT (0U)
#define CAM_CLRKEY_LOW_LIMIT_SET(x) (((uint32_t)(x) << CAM_CLRKEY_LOW_LIMIT_SHIFT) & CAM_CLRKEY_LOW_LIMIT_MASK)
#define CAM_CLRKEY_LOW_LIMIT_GET(x) (((uint32_t)(x) & CAM_CLRKEY_LOW_LIMIT_MASK) >> CAM_CLRKEY_LOW_LIMIT_SHIFT)

/* Bitfield definition for register: CLRKEY_HIGH */
/*
 * LIMIT (RW)
 *
 * Low range of color key applied to PS buffer. To disable PS colorkeying, set the low colorkey to 0xFFFFFF and the high colorkey to 0x000000.
 */
#define CAM_CLRKEY_HIGH_LIMIT_MASK (0xFFFFFFUL)
#define CAM_CLRKEY_HIGH_LIMIT_SHIFT (0U)
#define CAM_CLRKEY_HIGH_LIMIT_SET(x) (((uint32_t)(x) << CAM_CLRKEY_HIGH_LIMIT_SHIFT) & CAM_CLRKEY_HIGH_LIMIT_MASK)
#define CAM_CLRKEY_HIGH_LIMIT_GET(x) (((uint32_t)(x) & CAM_CLRKEY_HIGH_LIMIT_MASK) >> CAM_CLRKEY_HIGH_LIMIT_SHIFT)

/* Bitfield definition for register array: HISTOGRAM_FIFO */
/*
 * HIST_Y (RO)
 *
 * the appearance of bin x (x=(address-DATA0)/4)
 */
#define CAM_HISTOGRAM_FIFO_HIST_Y_MASK (0xFFFFFFUL)
#define CAM_HISTOGRAM_FIFO_HIST_Y_SHIFT (0U)
#define CAM_HISTOGRAM_FIFO_HIST_Y_GET(x) (((uint32_t)(x) & CAM_HISTOGRAM_FIFO_HIST_Y_MASK) >> CAM_HISTOGRAM_FIFO_HIST_Y_SHIFT)

/* Bitfield definition for register: ROI_WIDTH */
/*
 * ROI_WIDTH_END (RW)
 *
 * end address of width for roi
 */
#define CAM_ROI_WIDTH_ROI_WIDTH_END_MASK (0xFFFF0000UL)
#define CAM_ROI_WIDTH_ROI_WIDTH_END_SHIFT (16U)
#define CAM_ROI_WIDTH_ROI_WIDTH_END_SET(x) (((uint32_t)(x) << CAM_ROI_WIDTH_ROI_WIDTH_END_SHIFT) & CAM_ROI_WIDTH_ROI_WIDTH_END_MASK)
#define CAM_ROI_WIDTH_ROI_WIDTH_END_GET(x) (((uint32_t)(x) & CAM_ROI_WIDTH_ROI_WIDTH_END_MASK) >> CAM_ROI_WIDTH_ROI_WIDTH_END_SHIFT)

/*
 * ROI_WIDTH_START (RW)
 *
 * start address of width for roi
 */
#define CAM_ROI_WIDTH_ROI_WIDTH_START_MASK (0xFFFFU)
#define CAM_ROI_WIDTH_ROI_WIDTH_START_SHIFT (0U)
#define CAM_ROI_WIDTH_ROI_WIDTH_START_SET(x) (((uint32_t)(x) << CAM_ROI_WIDTH_ROI_WIDTH_START_SHIFT) & CAM_ROI_WIDTH_ROI_WIDTH_START_MASK)
#define CAM_ROI_WIDTH_ROI_WIDTH_START_GET(x) (((uint32_t)(x) & CAM_ROI_WIDTH_ROI_WIDTH_START_MASK) >> CAM_ROI_WIDTH_ROI_WIDTH_START_SHIFT)

/* Bitfield definition for register: ROI_HEIGHT */
/*
 * ROI_HEIGHT_END (RW)
 *
 * end address of height for roi
 */
#define CAM_ROI_HEIGHT_ROI_HEIGHT_END_MASK (0xFFFF0000UL)
#define CAM_ROI_HEIGHT_ROI_HEIGHT_END_SHIFT (16U)
#define CAM_ROI_HEIGHT_ROI_HEIGHT_END_SET(x) (((uint32_t)(x) << CAM_ROI_HEIGHT_ROI_HEIGHT_END_SHIFT) & CAM_ROI_HEIGHT_ROI_HEIGHT_END_MASK)
#define CAM_ROI_HEIGHT_ROI_HEIGHT_END_GET(x) (((uint32_t)(x) & CAM_ROI_HEIGHT_ROI_HEIGHT_END_MASK) >> CAM_ROI_HEIGHT_ROI_HEIGHT_END_SHIFT)

/*
 * ROI_HEIGHT_START (RW)
 *
 * start address of height for roi
 */
#define CAM_ROI_HEIGHT_ROI_HEIGHT_START_MASK (0xFFFFU)
#define CAM_ROI_HEIGHT_ROI_HEIGHT_START_SHIFT (0U)
#define CAM_ROI_HEIGHT_ROI_HEIGHT_START_SET(x) (((uint32_t)(x) << CAM_ROI_HEIGHT_ROI_HEIGHT_START_SHIFT) & CAM_ROI_HEIGHT_ROI_HEIGHT_START_MASK)
#define CAM_ROI_HEIGHT_ROI_HEIGHT_START_GET(x) (((uint32_t)(x) & CAM_ROI_HEIGHT_ROI_HEIGHT_START_MASK) >> CAM_ROI_HEIGHT_ROI_HEIGHT_START_SHIFT)

/* Bitfield definition for register: PRO_CTRL */
/*
 * ASYNC_FIFO_SEL (RW)
 *
 * 0 use fifo for sync
 * 1 use flipflop for sync
 */
#define CAM_PRO_CTRL_ASYNC_FIFO_SEL_MASK (0x8000U)
#define CAM_PRO_CTRL_ASYNC_FIFO_SEL_SHIFT (15U)
#define CAM_PRO_CTRL_ASYNC_FIFO_SEL_SET(x) (((uint32_t)(x) << CAM_PRO_CTRL_ASYNC_FIFO_SEL_SHIFT) & CAM_PRO_CTRL_ASYNC_FIFO_SEL_MASK)
#define CAM_PRO_CTRL_ASYNC_FIFO_SEL_GET(x) (((uint32_t)(x) & CAM_PRO_CTRL_ASYNC_FIFO_SEL_MASK) >> CAM_PRO_CTRL_ASYNC_FIFO_SEL_SHIFT)

/*
 * ERR_INJECT (RW)
 *
 * 0 generate alarm in normal mode
 * 1 force to generate fatal alarm
 */
#define CAM_PRO_CTRL_ERR_INJECT_MASK (0x4000U)
#define CAM_PRO_CTRL_ERR_INJECT_SHIFT (14U)
#define CAM_PRO_CTRL_ERR_INJECT_SET(x) (((uint32_t)(x) << CAM_PRO_CTRL_ERR_INJECT_SHIFT) & CAM_PRO_CTRL_ERR_INJECT_MASK)
#define CAM_PRO_CTRL_ERR_INJECT_GET(x) (((uint32_t)(x) & CAM_PRO_CTRL_ERR_INJECT_MASK) >> CAM_PRO_CTRL_ERR_INJECT_SHIFT)

/*
 * BAYER_BIG_ENDIAN (RW)
 *
 * 0 bayer data is little-endian
 * 1 bayer data is big-endian
 */
#define CAM_PRO_CTRL_BAYER_BIG_ENDIAN_MASK (0x2000U)
#define CAM_PRO_CTRL_BAYER_BIG_ENDIAN_SHIFT (13U)
#define CAM_PRO_CTRL_BAYER_BIG_ENDIAN_SET(x) (((uint32_t)(x) << CAM_PRO_CTRL_BAYER_BIG_ENDIAN_SHIFT) & CAM_PRO_CTRL_BAYER_BIG_ENDIAN_MASK)
#define CAM_PRO_CTRL_BAYER_BIG_ENDIAN_GET(x) (((uint32_t)(x) & CAM_PRO_CTRL_BAYER_BIG_ENDIAN_MASK) >> CAM_PRO_CTRL_BAYER_BIG_ENDIAN_SHIFT)

