hpmicro/rtt-bsp-hpm6750evk2/common/libraries/hpm_sdk/soc/ip/hpm_cam_regs.h
/*
 * READY_ERROR (W1C)
 *
 * indicate cam_te_b0_ready and cam_te_b1_ready assert at the same time
 * clear by writing 1
 */
#define CAM_PRO_CTRL_READY_ERROR_MASK (0x1000U)
#define CAM_PRO_CTRL_READY_ERROR_SHIFT (12U)
#define CAM_PRO_CTRL_READY_ERROR_SET(x) (((uint32_t)(x) << CAM_PRO_CTRL_READY_ERROR_SHIFT) & CAM_PRO_CTRL_READY_ERROR_MASK)
#define CAM_PRO_CTRL_READY_ERROR_GET(x) (((uint32_t)(x) & CAM_PRO_CTRL_READY_ERROR_MASK) >> CAM_PRO_CTRL_READY_ERROR_SHIFT)

/*
 * READY_ENABLE (RO)
 *
 * indicate cam_in_init assert
 */
#define CAM_PRO_CTRL_READY_ENABLE_MASK (0x800U)
#define CAM_PRO_CTRL_READY_ENABLE_SHIFT (11U)
#define CAM_PRO_CTRL_READY_ENABLE_GET(x) (((uint32_t)(x) & CAM_PRO_CTRL_READY_ENABLE_MASK) >> CAM_PRO_CTRL_READY_ENABLE_SHIFT)

/*
 * READY_DISABLE (RW)
 *
 * indicate cam_out_init de-assert
 */
#define CAM_PRO_CTRL_READY_DISABLE_MASK (0x400U)
#define CAM_PRO_CTRL_READY_DISABLE_SHIFT (10U)
#define CAM_PRO_CTRL_READY_DISABLE_SET(x) (((uint32_t)(x) << CAM_PRO_CTRL_READY_DISABLE_SHIFT) & CAM_PRO_CTRL_READY_DISABLE_MASK)
#define CAM_PRO_CTRL_READY_DISABLE_GET(x) (((uint32_t)(x) & CAM_PRO_CTRL_READY_DISABLE_MASK) >> CAM_PRO_CTRL_READY_DISABLE_SHIFT)

/*
 * BUFFER_SWITCH (RW)
 *
 * 00 switch buffer every frame
 * 01 switch buffer every 8 lines
 * 10 switch buffer every 16 lines
 */
#define CAM_PRO_CTRL_BUFFER_SWITCH_MASK (0x300U)
#define CAM_PRO_CTRL_BUFFER_SWITCH_SHIFT (8U)
#define CAM_PRO_CTRL_BUFFER_SWITCH_SET(x) (((uint32_t)(x) << CAM_PRO_CTRL_BUFFER_SWITCH_SHIFT) & CAM_PRO_CTRL_BUFFER_SWITCH_MASK)
#define CAM_PRO_CTRL_BUFFER_SWITCH_GET(x) (((uint32_t)(x) & CAM_PRO_CTRL_BUFFER_SWITCH_MASK) >> CAM_PRO_CTRL_BUFFER_SWITCH_SHIFT)

/*
 * ROI_UPDATE (RW)
 *
 * roi configration update
 */
#define CAM_PRO_CTRL_ROI_UPDATE_MASK (0x80U)
#define CAM_PRO_CTRL_ROI_UPDATE_SHIFT (7U)
#define CAM_PRO_CTRL_ROI_UPDATE_SET(x) (((uint32_t)(x) << CAM_PRO_CTRL_ROI_UPDATE_SHIFT) & CAM_PRO_CTRL_ROI_UPDATE_MASK)
#define CAM_PRO_CTRL_ROI_UPDATE_GET(x) (((uint32_t)(x) & CAM_PRO_CTRL_ROI_UPDATE_MASK) >> CAM_PRO_CTRL_ROI_UPDATE_SHIFT)

/*
 * SCALE_UPDATE (RW)
 *
 * scale configration update
 */
#define CAM_PRO_CTRL_SCALE_UPDATE_MASK (0x40U)
#define CAM_PRO_CTRL_SCALE_UPDATE_SHIFT (6U)
#define CAM_PRO_CTRL_SCALE_UPDATE_SET(x) (((uint32_t)(x) << CAM_PRO_CTRL_SCALE_UPDATE_SHIFT) & CAM_PRO_CTRL_SCALE_UPDATE_MASK)
#define CAM_PRO_CTRL_SCALE_UPDATE_GET(x) (((uint32_t)(x) & CAM_PRO_CTRL_SCALE_UPDATE_MASK) >> CAM_PRO_CTRL_SCALE_UPDATE_SHIFT)

/*
 * SCALE_HEIGHT_SELECT (RW)
 *
 * 000 keep all pixel for height
 * 001 keep 1 for every 2 pixel for height
 * 010 keep 1 for every 3 pixel for height
 * 011 keep 1 for every 4 pixel for height
 * 100 keep 1 for every 5 pixel for height
 * 101 keep 1 for every 6 pixel for height
 * 110 keep 1 for every 7 pixel for height
 * 111 keep 1 for every 8 pixel for height
 */
#define CAM_PRO_CTRL_SCALE_HEIGHT_SELECT_MASK (0x38U)
#define CAM_PRO_CTRL_SCALE_HEIGHT_SELECT_SHIFT (3U)
#define CAM_PRO_CTRL_SCALE_HEIGHT_SELECT_SET(x) (((uint32_t)(x) << CAM_PRO_CTRL_SCALE_HEIGHT_SELECT_SHIFT) & CAM_PRO_CTRL_SCALE_HEIGHT_SELECT_MASK)
#define CAM_PRO_CTRL_SCALE_HEIGHT_SELECT_GET(x) (((uint32_t)(x) & CAM_PRO_CTRL_SCALE_HEIGHT_SELECT_MASK) >> CAM_PRO_CTRL_SCALE_HEIGHT_SELECT_SHIFT)

/*
 * SCALE_WIDTH_SELECT (RW)
 *
 * 000 keep all pixel for width
 * 001 keep 1 for every 2 pixel for width
 * 010 keep 1 for every 3 pixel for width
 * 011 keep 1 for every 4 pixel for width
 * 100 keep 1 for every 5 pixel for width
 * 101 keep 1 for every 6 pixel for width
 * 110 keep 1 for every 7 pixel for width
 * 111 keep 1 for every 8 pixel for width
 */
#define CAM_PRO_CTRL_SCALE_WIDTH_SELECT_MASK (0x7U)
#define CAM_PRO_CTRL_SCALE_WIDTH_SELECT_SHIFT (0U)
#define CAM_PRO_CTRL_SCALE_WIDTH_SELECT_SET(x) (((uint32_t)(x) << CAM_PRO_CTRL_SCALE_WIDTH_SELECT_SHIFT) & CAM_PRO_CTRL_SCALE_WIDTH_SELECT_MASK)
#define CAM_PRO_CTRL_SCALE_WIDTH_SELECT_GET(x) (((uint32_t)(x) & CAM_PRO_CTRL_SCALE_WIDTH_SELECT_MASK) >> CAM_PRO_CTRL_SCALE_WIDTH_SELECT_SHIFT)

/* Bitfield definition for register: ACT_SIZE */
/*
 * ACT_HEIGHT (RW)
 *
 * actual height after scale and/or roi
 */
#define CAM_ACT_SIZE_ACT_HEIGHT_MASK (0xFFFF0000UL)
#define CAM_ACT_SIZE_ACT_HEIGHT_SHIFT (16U)
#define CAM_ACT_SIZE_ACT_HEIGHT_SET(x) (((uint32_t)(x) << CAM_ACT_SIZE_ACT_HEIGHT_SHIFT) & CAM_ACT_SIZE_ACT_HEIGHT_MASK)
#define CAM_ACT_SIZE_ACT_HEIGHT_GET(x) (((uint32_t)(x) & CAM_ACT_SIZE_ACT_HEIGHT_MASK) >> CAM_ACT_SIZE_ACT_HEIGHT_SHIFT)

/*
 * ACT_WIDTH (RW)
 *
 * actual width after scale and/or roi
 */
#define CAM_ACT_SIZE_ACT_WIDTH_MASK (0xFFFFU)
#define CAM_ACT_SIZE_ACT_WIDTH_SHIFT (0U)
#define CAM_ACT_SIZE_ACT_WIDTH_SET(x) (((uint32_t)(x) << CAM_ACT_SIZE_ACT_WIDTH_SHIFT) & CAM_ACT_SIZE_ACT_WIDTH_MASK)
#define CAM_ACT_SIZE_ACT_WIDTH_GET(x) (((uint32_t)(x) & CAM_ACT_SIZE_ACT_WIDTH_MASK) >> CAM_ACT_SIZE_ACT_WIDTH_SHIFT)

/* Bitfield definition for register: VSYNC_VALID_CNT */
/*
 * VSYNC_VALID_CNT (RW)
 *
 * vsync valid counter
 */
#define CAM_VSYNC_VALID_CNT_VSYNC_VALID_CNT_MASK (0xFFFFFFFFUL)
#define CAM_VSYNC_VALID_CNT_VSYNC_VALID_CNT_SHIFT (0U)
#define CAM_VSYNC_VALID_CNT_VSYNC_VALID_CNT_SET(x) (((uint32_t)(x) << CAM_VSYNC_VALID_CNT_VSYNC_VALID_CNT_SHIFT) & CAM_VSYNC_VALID_CNT_VSYNC_VALID_CNT_MASK)
#define CAM_VSYNC_VALID_CNT_VSYNC_VALID_CNT_GET(x) (((uint32_t)(x) & CAM_VSYNC_VALID_CNT_VSYNC_VALID_CNT_MASK) >> CAM_VSYNC_VALID_CNT_VSYNC_VALID_CNT_SHIFT)

/* Bitfield definition for register: HSYNC_VALID_CNT */
/*
 * HSYNC_VALID_CNT (RW)
 *
 * hsync valid counter
 */
#define CAM_HSYNC_VALID_CNT_HSYNC_VALID_CNT_MASK (0xFFFFFFFFUL)
#define CAM_HSYNC_VALID_CNT_HSYNC_VALID_CNT_SHIFT (0U)
#define CAM_HSYNC_VALID_CNT_HSYNC_VALID_CNT_SET(x) (((uint32_t)(x) << CAM_HSYNC_VALID_CNT_HSYNC_VALID_CNT_SHIFT) & CAM_HSYNC_VALID_CNT_HSYNC_VALID_CNT_MASK)
#define CAM_HSYNC_VALID_CNT_HSYNC_VALID_CNT_GET(x) (((uint32_t)(x) & CAM_HSYNC_VALID_CNT_HSYNC_VALID_CNT_MASK) >> CAM_HSYNC_VALID_CNT_HSYNC_VALID_CNT_SHIFT)

