hpmicro/rtt-bsp-hpm6750evk2/common/libraries/hpm_sdk/soc/ip/hpm_cam_regs.h
/* Bitfield definition for register: VALID_MARGIN */
/*
 * HSYNC_VALID_MARGIN (RW)
 *
 * hsync valid margin
 */
#define CAM_VALID_MARGIN_HSYNC_VALID_MARGIN_MASK (0xFFFF0000UL)
#define CAM_VALID_MARGIN_HSYNC_VALID_MARGIN_SHIFT (16U)
#define CAM_VALID_MARGIN_HSYNC_VALID_MARGIN_SET(x) (((uint32_t)(x) << CAM_VALID_MARGIN_HSYNC_VALID_MARGIN_SHIFT) & CAM_VALID_MARGIN_HSYNC_VALID_MARGIN_MASK)
#define CAM_VALID_MARGIN_HSYNC_VALID_MARGIN_GET(x) (((uint32_t)(x) & CAM_VALID_MARGIN_HSYNC_VALID_MARGIN_MASK) >> CAM_VALID_MARGIN_HSYNC_VALID_MARGIN_SHIFT)

/*
 * VSYNC_VALID_MARGIN (RW)
 *
 * vsync valid margin
 */
#define CAM_VALID_MARGIN_VSYNC_VALID_MARGIN_MASK (0xFFFFU)
#define CAM_VALID_MARGIN_VSYNC_VALID_MARGIN_SHIFT (0U)
#define CAM_VALID_MARGIN_VSYNC_VALID_MARGIN_SET(x) (((uint32_t)(x) << CAM_VALID_MARGIN_VSYNC_VALID_MARGIN_SHIFT) & CAM_VALID_MARGIN_VSYNC_VALID_MARGIN_MASK)
#define CAM_VALID_MARGIN_VSYNC_VALID_MARGIN_GET(x) (((uint32_t)(x) & CAM_VALID_MARGIN_VSYNC_VALID_MARGIN_MASK) >> CAM_VALID_MARGIN_VSYNC_VALID_MARGIN_SHIFT)

/* Bitfield definition for register: ALARM_SET */
/*
 * SIG_NORMAL (RW)
 *
 * define signal duty cycles(base clock)
 * 0x0: disable signal
 * 0x1:  high 1, low 15
 * 0x2:  high 2, low 14
 * …...
 * 0xF:   high 15, low 1
 */
#define CAM_ALARM_SET_SIG_NORMAL_MASK (0xF00000UL)
#define CAM_ALARM_SET_SIG_NORMAL_SHIFT (20U)
#define CAM_ALARM_SET_SIG_NORMAL_SET(x) (((uint32_t)(x) << CAM_ALARM_SET_SIG_NORMAL_SHIFT) & CAM_ALARM_SET_SIG_NORMAL_MASK)
#define CAM_ALARM_SET_SIG_NORMAL_GET(x) (((uint32_t)(x) & CAM_ALARM_SET_SIG_NORMAL_MASK) >> CAM_ALARM_SET_SIG_NORMAL_SHIFT)

/*
 * FATAL_NORMAL (RW)
 *
 * define signal duty cycles(base clock)
 * 0x0: disable signal
 * 0x1:  high 1, low 15
 * 0x2:  high 2, low 14
 * …...
 * 0xF:   high 15, low 1
 */
#define CAM_ALARM_SET_FATAL_NORMAL_MASK (0xF0000UL)
#define CAM_ALARM_SET_FATAL_NORMAL_SHIFT (16U)
#define CAM_ALARM_SET_FATAL_NORMAL_SET(x) (((uint32_t)(x) << CAM_ALARM_SET_FATAL_NORMAL_SHIFT) & CAM_ALARM_SET_FATAL_NORMAL_MASK)
#define CAM_ALARM_SET_FATAL_NORMAL_GET(x) (((uint32_t)(x) & CAM_ALARM_SET_FATAL_NORMAL_MASK) >> CAM_ALARM_SET_FATAL_NORMAL_SHIFT)

/*
 * PRE_DIV (RW)
 *
 * frequency division
 */
#define CAM_ALARM_SET_PRE_DIV_MASK (0xFFFFU)
#define CAM_ALARM_SET_PRE_DIV_SHIFT (0U)
#define CAM_ALARM_SET_PRE_DIV_SET(x) (((uint32_t)(x) << CAM_ALARM_SET_PRE_DIV_SHIFT) & CAM_ALARM_SET_PRE_DIV_MASK)
#define CAM_ALARM_SET_PRE_DIV_GET(x) (((uint32_t)(x) & CAM_ALARM_SET_PRE_DIV_MASK) >> CAM_ALARM_SET_PRE_DIV_SHIFT)



/* HISTOGRAM_FIFO register group index macro definition */
#define CAM_HISTOGRAM_FIFO_DATA0 (0UL)
#define CAM_HISTOGRAM_FIFO_DATA1 (1UL)
#define CAM_HISTOGRAM_FIFO_DATA2 (2UL)
#define CAM_HISTOGRAM_FIFO_DATA3 (3UL)
#define CAM_HISTOGRAM_FIFO_DATA4 (4UL)
#define CAM_HISTOGRAM_FIFO_DATA5 (5UL)
#define CAM_HISTOGRAM_FIFO_DATA6 (6UL)
#define CAM_HISTOGRAM_FIFO_DATA7 (7UL)
#define CAM_HISTOGRAM_FIFO_DATA8 (8UL)
#define CAM_HISTOGRAM_FIFO_DATA9 (9UL)
#define CAM_HISTOGRAM_FIFO_DATA10 (10UL)
#define CAM_HISTOGRAM_FIFO_DATA11 (11UL)
#define CAM_HISTOGRAM_FIFO_DATA12 (12UL)
#define CAM_HISTOGRAM_FIFO_DATA13 (13UL)
#define CAM_HISTOGRAM_FIFO_DATA14 (14UL)
#define CAM_HISTOGRAM_FIFO_DATA15 (15UL)
#define CAM_HISTOGRAM_FIFO_DATA16 (16UL)
#define CAM_HISTOGRAM_FIFO_DATA17 (17UL)
#define CAM_HISTOGRAM_FIFO_DATA18 (18UL)
#define CAM_HISTOGRAM_FIFO_DATA19 (19UL)
#define CAM_HISTOGRAM_FIFO_DATA20 (20UL)
#define CAM_HISTOGRAM_FIFO_DATA21 (21UL)
#define CAM_HISTOGRAM_FIFO_DATA22 (22UL)
#define CAM_HISTOGRAM_FIFO_DATA23 (23UL)
#define CAM_HISTOGRAM_FIFO_DATA24 (24UL)
#define CAM_HISTOGRAM_FIFO_DATA25 (25UL)
#define CAM_HISTOGRAM_FIFO_DATA26 (26UL)
#define CAM_HISTOGRAM_FIFO_DATA27 (27UL)
#define CAM_HISTOGRAM_FIFO_DATA28 (28UL)
#define CAM_HISTOGRAM_FIFO_DATA29 (29UL)
#define CAM_HISTOGRAM_FIFO_DATA30 (30UL)
#define CAM_HISTOGRAM_FIFO_DATA31 (31UL)
#define CAM_HISTOGRAM_FIFO_DATA32 (32UL)
#define CAM_HISTOGRAM_FIFO_DATA33 (33UL)
#define CAM_HISTOGRAM_FIFO_DATA34 (34UL)
#define CAM_HISTOGRAM_FIFO_DATA35 (35UL)
#define CAM_HISTOGRAM_FIFO_DATA36 (36UL)
#define CAM_HISTOGRAM_FIFO_DATA37 (37UL)
#define CAM_HISTOGRAM_FIFO_DATA38 (38UL)
#define CAM_HISTOGRAM_FIFO_DATA39 (39UL)
#define CAM_HISTOGRAM_FIFO_DATA40 (40UL)
#define CAM_HISTOGRAM_FIFO_DATA41 (41UL)
#define CAM_HISTOGRAM_FIFO_DATA42 (42UL)
#define CAM_HISTOGRAM_FIFO_DATA43 (43UL)
#define CAM_HISTOGRAM_FIFO_DATA44 (44UL)
#define CAM_HISTOGRAM_FIFO_DATA45 (45UL)
#define CAM_HISTOGRAM_FIFO_DATA46 (46UL)
#define CAM_HISTOGRAM_FIFO_DATA47 (47UL)
#define CAM_HISTOGRAM_FIFO_DATA48 (48UL)
#define CAM_HISTOGRAM_FIFO_DATA49 (49UL)
#define CAM_HISTOGRAM_FIFO_DATA50 (50UL)
#define CAM_HISTOGRAM_FIFO_DATA51 (51UL)
#define CAM_HISTOGRAM_FIFO_DATA52 (52UL)
#define CAM_HISTOGRAM_FIFO_DATA53 (53UL)
#define CAM_HISTOGRAM_FIFO_DATA54 (54UL)
#define CAM_HISTOGRAM_FIFO_DATA55 (55UL)
#define CAM_HISTOGRAM_FIFO_DATA56 (56UL)
#define CAM_HISTOGRAM_FIFO_DATA57 (57UL)
#define CAM_HISTOGRAM_FIFO_DATA58 (58UL)
#define CAM_HISTOGRAM_FIFO_DATA59 (59UL)
#define CAM_HISTOGRAM_FIFO_DATA60 (60UL)
#define CAM_HISTOGRAM_FIFO_DATA61 (61UL)
#define CAM_HISTOGRAM_FIFO_DATA62 (62UL)
#define CAM_HISTOGRAM_FIFO_DATA63 (63UL)
#define CAM_HISTOGRAM_FIFO_DATA64 (64UL)
#define CAM_HISTOGRAM_FIFO_DATA65 (65UL)
#define CAM_HISTOGRAM_FIFO_DATA66 (66UL)
#define CAM_HISTOGRAM_FIFO_DATA67 (67UL)
#define CAM_HISTOGRAM_FIFO_DATA68 (68UL)
#define CAM_HISTOGRAM_FIFO_DATA69 (69UL)
#define CAM_HISTOGRAM_FIFO_DATA70 (70UL)
#define CAM_HISTOGRAM_FIFO_DATA71 (71UL)
#define CAM_HISTOGRAM_FIFO_DATA72 (72UL)
#define CAM_HISTOGRAM_FIFO_DATA73 (73UL)
#define CAM_HISTOGRAM_FIFO_DATA74 (74UL)
#define CAM_HISTOGRAM_FIFO_DATA75 (75UL)
#define CAM_HISTOGRAM_FIFO_DATA76 (76UL)
#define CAM_HISTOGRAM_FIFO_DATA77 (77UL)
#define CAM_HISTOGRAM_FIFO_DATA78 (78UL)
#define CAM_HISTOGRAM_FIFO_DATA79 (79UL)
#define CAM_HISTOGRAM_FIFO_DATA80 (80UL)
#define CAM_HISTOGRAM_FIFO_DATA81 (81UL)
#define CAM_HISTOGRAM_FIFO_DATA82 (82UL)
#define CAM_HISTOGRAM_FIFO_DATA83 (83UL)
#define CAM_HISTOGRAM_FIFO_DATA84 (84UL)
#define CAM_HISTOGRAM_FIFO_DATA85 (85UL)
#define CAM_HISTOGRAM_FIFO_DATA86 (86UL)
#define CAM_HISTOGRAM_FIFO_DATA87 (87UL)
#define CAM_HISTOGRAM_FIFO_DATA88 (88UL)
#define CAM_HISTOGRAM_FIFO_DATA89 (89UL)
#define CAM_HISTOGRAM_FIFO_DATA90 (90UL)
#define CAM_HISTOGRAM_FIFO_DATA91 (91UL)
#define CAM_HISTOGRAM_FIFO_DATA92 (92UL)
#define CAM_HISTOGRAM_FIFO_DATA93 (93UL)
#define CAM_HISTOGRAM_FIFO_DATA94 (94UL)
#define CAM_HISTOGRAM_FIFO_DATA95 (95UL)
#define CAM_HISTOGRAM_FIFO_DATA96 (96UL)
#define CAM_HISTOGRAM_FIFO_DATA97 (97UL)
#define CAM_HISTOGRAM_FIFO_DATA98 (98UL)
#define CAM_HISTOGRAM_FIFO_DATA99 (99UL)
#define CAM_HISTOGRAM_FIFO_DATA100 (100UL)
#define CAM_HISTOGRAM_FIFO_DATA101 (101UL)
#define CAM_HISTOGRAM_FIFO_DATA102 (102UL)
#define CAM_HISTOGRAM_FIFO_DATA103 (103UL)
#define CAM_HISTOGRAM_FIFO_DATA104 (104UL)
#define CAM_HISTOGRAM_FIFO_DATA105 (105UL)
#define CAM_HISTOGRAM_FIFO_DATA106 (106UL)
#define CAM_HISTOGRAM_FIFO_DATA107 (107UL)
#define CAM_HISTOGRAM_FIFO_DATA108 (108UL)
#define CAM_HISTOGRAM_FIFO_DATA109 (109UL)
#define CAM_HISTOGRAM_FIFO_DATA110 (110UL)
#define CAM_HISTOGRAM_FIFO_DATA111 (111UL)
#define CAM_HISTOGRAM_FIFO_DATA112 (112UL)
#define CAM_HISTOGRAM_FIFO_DATA113 (113UL)
#define CAM_HISTOGRAM_FIFO_DATA114 (114UL)
#define CAM_HISTOGRAM_FIFO_DATA115 (115UL)
#define CAM_HISTOGRAM_FIFO_DATA116 (116UL)
#define CAM_HISTOGRAM_FIFO_DATA117 (117UL)
#define CAM_HISTOGRAM_FIFO_DATA118 (118UL)
#define CAM_HISTOGRAM_FIFO_DATA119 (119UL)
#define CAM_HISTOGRAM_FIFO_DATA120 (120UL)
#define CAM_HISTOGRAM_FIFO_DATA121 (121UL)
#define CAM_HISTOGRAM_FIFO_DATA122 (122UL)
#define CAM_HISTOGRAM_FIFO_DATA123 (123UL)
#define CAM_HISTOGRAM_FIFO_DATA124 (124UL)
#define CAM_HISTOGRAM_FIFO_DATA125 (125UL)
#define CAM_HISTOGRAM_FIFO_DATA126 (126UL)
#define CAM_HISTOGRAM_FIFO_DATA127 (127UL)
#define CAM_HISTOGRAM_FIFO_DATA128 (128UL)
#define CAM_HISTOGRAM_FIFO_DATA129 (129UL)
#define CAM_HISTOGRAM_FIFO_DATA130 (130UL)
#define CAM_HISTOGRAM_FIFO_DATA131 (131UL)
#define CAM_HISTOGRAM_FIFO_DATA132 (132UL)
#define CAM_HISTOGRAM_FIFO_DATA133 (133UL)
#define CAM_HISTOGRAM_FIFO_DATA134 (134UL)
#define CAM_HISTOGRAM_FIFO_DATA135 (135UL)
#define CAM_HISTOGRAM_FIFO_DATA136 (136UL)
#define CAM_HISTOGRAM_FIFO_DATA137 (137UL)
#define CAM_HISTOGRAM_FIFO_DATA138 (138UL)
#define CAM_HISTOGRAM_FIFO_DATA139 (139UL)
#define CAM_HISTOGRAM_FIFO_DATA140 (140UL)
#define CAM_HISTOGRAM_FIFO_DATA141 (141UL)
#define CAM_HISTOGRAM_FIFO_DATA142 (142UL)
#define CAM_HISTOGRAM_FIFO_DATA143 (143UL)
#define CAM_HISTOGRAM_FIFO_DATA144 (144UL)
#define CAM_HISTOGRAM_FIFO_DATA145 (145UL)
#define CAM_HISTOGRAM_FIFO_DATA146 (146UL)
#define CAM_HISTOGRAM_FIFO_DATA147 (147UL)
#define CAM_HISTOGRAM_FIFO_DATA148 (148UL)
#define CAM_HISTOGRAM_FIFO_DATA149 (149UL)
#define CAM_HISTOGRAM_FIFO_DATA150 (150UL)
#define CAM_HISTOGRAM_FIFO_DATA151 (151UL)
#define CAM_HISTOGRAM_FIFO_DATA152 (152UL)
#define CAM_HISTOGRAM_FIFO_DATA153 (153UL)
#define CAM_HISTOGRAM_FIFO_DATA154 (154UL)
#define CAM_HISTOGRAM_FIFO_DATA155 (155UL)
#define CAM_HISTOGRAM_FIFO_DATA156 (156UL)
#define CAM_HISTOGRAM_FIFO_DATA157 (157UL)
#define CAM_HISTOGRAM_FIFO_DATA158 (158UL)
#define CAM_HISTOGRAM_FIFO_DATA159 (159UL)
#define CAM_HISTOGRAM_FIFO_DATA160 (160UL)
#define CAM_HISTOGRAM_FIFO_DATA161 (161UL)
#define CAM_HISTOGRAM_FIFO_DATA162 (162UL)
#define CAM_HISTOGRAM_FIFO_DATA163 (163UL)
#define CAM_HISTOGRAM_FIFO_DATA164 (164UL)
#define CAM_HISTOGRAM_FIFO_DATA165 (165UL)
#define CAM_HISTOGRAM_FIFO_DATA166 (166UL)
#define CAM_HISTOGRAM_FIFO_DATA167 (167UL)
#define CAM_HISTOGRAM_FIFO_DATA168 (168UL)
#define CAM_HISTOGRAM_FIFO_DATA169 (169UL)
#define CAM_HISTOGRAM_FIFO_DATA170 (170UL)
#define CAM_HISTOGRAM_FIFO_DATA171 (171UL)
#define CAM_HISTOGRAM_FIFO_DATA172 (172UL)
#define CAM_HISTOGRAM_FIFO_DATA173 (173UL)
#define CAM_HISTOGRAM_FIFO_DATA174 (174UL)
#define CAM_HISTOGRAM_FIFO_DATA175 (175UL)
#define CAM_HISTOGRAM_FIFO_DATA176 (176UL)
#define CAM_HISTOGRAM_FIFO_DATA177 (177UL)
#define CAM_HISTOGRAM_FIFO_DATA178 (178UL)
#define CAM_HISTOGRAM_FIFO_DATA179 (179UL)
#define CAM_HISTOGRAM_FIFO_DATA180 (180UL)
#define CAM_HISTOGRAM_FIFO_DATA181 (181UL)
#define CAM_HISTOGRAM_FIFO_DATA182 (182UL)
#define CAM_HISTOGRAM_FIFO_DATA183 (183UL)
#define CAM_HISTOGRAM_FIFO_DATA184 (184UL)
#define CAM_HISTOGRAM_FIFO_DATA185 (185UL)
#define CAM_HISTOGRAM_FIFO_DATA186 (186UL)
#define CAM_HISTOGRAM_FIFO_DATA187 (187UL)
#define CAM_HISTOGRAM_FIFO_DATA188 (188UL)
#define CAM_HISTOGRAM_FIFO_DATA189 (189UL)
#define CAM_HISTOGRAM_FIFO_DATA190 (190UL)
#define CAM_HISTOGRAM_FIFO_DATA191 (191UL)
#define CAM_HISTOGRAM_FIFO_DATA192 (192UL)
#define CAM_HISTOGRAM_FIFO_DATA193 (193UL)
#define CAM_HISTOGRAM_FIFO_DATA194 (194UL)
#define CAM_HISTOGRAM_FIFO_DATA195 (195UL)
#define CAM_HISTOGRAM_FIFO_DATA196 (196UL)
#define CAM_HISTOGRAM_FIFO_DATA197 (197UL)
#define CAM_HISTOGRAM_FIFO_DATA198 (198UL)
#define CAM_HISTOGRAM_FIFO_DATA199 (199UL)
#define CAM_HISTOGRAM_FIFO_DATA200 (200UL)
#define CAM_HISTOGRAM_FIFO_DATA201 (201UL)
#define CAM_HISTOGRAM_FIFO_DATA202 (202UL)
#define CAM_HISTOGRAM_FIFO_DATA203 (203UL)
#define CAM_HISTOGRAM_FIFO_DATA204 (204UL)
#define CAM_HISTOGRAM_FIFO_DATA205 (205UL)
#define CAM_HISTOGRAM_FIFO_DATA206 (206UL)
#define CAM_HISTOGRAM_FIFO_DATA207 (207UL)
#define CAM_HISTOGRAM_FIFO_DATA208 (208UL)
#define CAM_HISTOGRAM_FIFO_DATA209 (209UL)
#define CAM_HISTOGRAM_FIFO_DATA210 (210UL)
#define CAM_HISTOGRAM_FIFO_DATA211 (211UL)
#define CAM_HISTOGRAM_FIFO_DATA212 (212UL)
#define CAM_HISTOGRAM_FIFO_DATA213 (213UL)
#define CAM_HISTOGRAM_FIFO_DATA214 (214UL)
#define CAM_HISTOGRAM_FIFO_DATA215 (215UL)
#define CAM_HISTOGRAM_FIFO_DATA216 (216UL)
#define CAM_HISTOGRAM_FIFO_DATA217 (217UL)
#define CAM_HISTOGRAM_FIFO_DATA218 (218UL)
#define CAM_HISTOGRAM_FIFO_DATA219 (219UL)
#define CAM_HISTOGRAM_FIFO_DATA220 (220UL)
#define CAM_HISTOGRAM_FIFO_DATA221 (221UL)
#define CAM_HISTOGRAM_FIFO_DATA222 (222UL)
#define CAM_HISTOGRAM_FIFO_DATA223 (223UL)
#define CAM_HISTOGRAM_FIFO_DATA224 (224UL)
#define CAM_HISTOGRAM_FIFO_DATA225 (225UL)
#define CAM_HISTOGRAM_FIFO_DATA226 (226UL)
#define CAM_HISTOGRAM_FIFO_DATA227 (227UL)
#define CAM_HISTOGRAM_FIFO_DATA228 (228UL)
#define CAM_HISTOGRAM_FIFO_DATA229 (229UL)
#define CAM_HISTOGRAM_FIFO_DATA230 (230UL)
#define CAM_HISTOGRAM_FIFO_DATA231 (231UL)
#define CAM_HISTOGRAM_FIFO_DATA232 (232UL)
#define CAM_HISTOGRAM_FIFO_DATA233 (233UL)
#define CAM_HISTOGRAM_FIFO_DATA234 (234UL)
#define CAM_HISTOGRAM_FIFO_DATA235 (235UL)
#define CAM_HISTOGRAM_FIFO_DATA236 (236UL)
#define CAM_HISTOGRAM_FIFO_DATA237 (237UL)
#define CAM_HISTOGRAM_FIFO_DATA238 (238UL)
#define CAM_HISTOGRAM_FIFO_DATA239 (239UL)
#define CAM_HISTOGRAM_FIFO_DATA240 (240UL)
#define CAM_HISTOGRAM_FIFO_DATA241 (241UL)
#define CAM_HISTOGRAM_FIFO_DATA242 (242UL)
#define CAM_HISTOGRAM_FIFO_DATA243 (243UL)
#define CAM_HISTOGRAM_FIFO_DATA244 (244UL)
#define CAM_HISTOGRAM_FIFO_DATA245 (245UL)
#define CAM_HISTOGRAM_FIFO_DATA246 (246UL)
#define CAM_HISTOGRAM_FIFO_DATA247 (247UL)
#define CAM_HISTOGRAM_FIFO_DATA248 (248UL)
#define CAM_HISTOGRAM_FIFO_DATA249 (249UL)
#define CAM_HISTOGRAM_FIFO_DATA250 (250UL)
#define CAM_HISTOGRAM_FIFO_DATA251 (251UL)
#define CAM_HISTOGRAM_FIFO_DATA252 (252UL)
#define CAM_HISTOGRAM_FIFO_DATA253 (253UL)
#define CAM_HISTOGRAM_FIFO_DATA254 (254UL)
#define CAM_HISTOGRAM_FIFO_DATA255 (255UL)


#endif /* HPM_CAM_H */
